[
    {
        "nombre": "Introducción a la comunicación científica",
        "profesor": "Fernando Raúl Rodríguez Flores",
        "descripcion": "Objetivo de la asignatura: \nQue los estudiantes sean capaces de comunicar resultados científicos, de manera correcta y amena, en forma de presentación oral, documento escrito o material audiovisual, utilizando las herramientas existentes para esos propósitos.\n\nSistema de conocimientos: \nAspectos esenciales de la comunicación: objetivo, público, beneficio, y estrucutras lógica.  Canales de comunicación visuales, auditivos y cinéticos.  Control de la atención.  La importancia de la emoción y el entretenimiento.  Reglas de la comunicación.  Elementos básicos del humor aplicado a la comunicación.\nElementos básicos de una presentación: aperturas, desarrollo, cierro.  Elementos básicos de diseño gráfico: contraste, alineación, proximidad, repetición.  Regla del 7x7 en presentaciones.\nElementos básicos de redacción científica.  Estilos de redacción.  Organización del documento.  Referencias bibliográficas.  Gestores bibliográficos.  LaTeX, Word, LibreOffice.\nElementos básicos de audiovisuales.  Comunicación de la ciencia para públicos no especializados.\nEvaluación: Presentación de los temas de investigación de los estudiantes.\n\nBibliografía:\nG. Michael Campbell. Bullet proof presentations. Career Press, 2003.\nMichael Alley. The craft of scientific presentations. Springer 2003.\nRobin Williams. The non-designer’s design book. 2nd Edition. Peachpit press. California. 2004.",
        "plazas": 20,
        "relacionadas": []
    },
    {
        "nombre": "Introducción a la Programación Web",
        "profesor": "MSc. Fernando Rodriguez Flores, Lic Javier Rodriguez Sánchez",
        "descripcion": "Años y carreras a las que va dirigido: Estudiantes de segundo año de licenciatura en Matemática.\n \nObjetivo de la asignatura: \n\n   Presentar los elementos básicos de la programación web y la gestión de bases de datos a estudiantes de Matemática.\nSistema de conocimientos:\n\n  Funcionamiento interno de una aplicación web: frontend, backend.   Elementos básicos de  HTML, CSS, Javascript.  Elementos básicos de bases de datos relacionales.  Introducción a SQL.  Elementos básicos del funcionamiento de un ORM (Object Relational Mapping).  Introducción a la biblioteca Django de Python.\nEvaluación:\n\nSeminarios y tareas individuales.\n\nBibliografía:\n  - J.D Gauchat \"El gran Libro de HTML5, CSS3, JavaScript\", 3ra Edición, Marcombo, 2017\n  - Brian Yu, \"Web Programming with Python and JavaScript\" Harvard University, Division of Continuing Education",
        "plazas": 10,
        "relacionadas": [
            "Programación",
            "Base de Datos"
        ]
    },
    {
        "nombre": "Tópicos de Matemática Aplicada",
        "profesor": "MSc. Fernando Rodriguez Flores",
        "descripcion": "Años y carreras a las que va dirigido: Estudiantes de segundo año de Ciencia de la Computación.\n \nObjetivo de la asignatura: \n\n El objetivo de la asignatura es que los estudiantes realizen un trabajo en el que apliquen conocimientos y habilidades relacionadas con las asignaturas que han recibido hasta el segundo semestre de segundo año: ecuaciones diferenciales, álgebra lineal numérica, matemática numérica y probabilidades.\nSistema de conocimientos:\n\n   Introducción a la investigación en matemática aplicada.  EDOs aplicadas al análisis de batallas.  Elementos básicos de procesamiento de imágenes.  Elementos de regresión simbólica.  Regresión simbólica para EDOs.  Elementos básicos de redes neuronales. Elementos de visualización de algoritmos numéricos.  Elementos matemático/computacionales del diseño de juegos.  Introducción a la matemática de los malabares.\nEvaluación:\n\nLos estudiantes deben realizar un trabajo investigativo relacionado con los elementos presentados en la asignatura.  Deben hacer la revisión bibliográfica, proponer una solución, implementarla, realizar experimentos numéricos, escribir un documento técnico y realizar una presentación oral de elementos técnicos.\n\nBibliografía:\nProbabilities and statistics for computer Scientists.”, Michael Baron. 2nd Edition. CRC Press. 2014.\n\"Scientific Computing. An Introductory Survey\". M. Heath. 2nd Edition.  McGraw-Hill Book Company, 2002\nLawrence Perko. Differential Equations and Dynamical Systems. Third Edition. Editorial Springer (Texto Digital)\nHam, E. Tabletop game design for video game designers. Routledge.  2015\nPolster, B. The mathematics of juggling. Springer-Verlag.  2000.",
        "plazas": 15,
        "relacionadas": [
            "Estructura de Datos y Algoritmos",
            "Ecuaciones Diferenciales Ordinarias",
            "Álgebra Lineal",
            "Matemática Numérica",
            "Probabilidades"
        ]
    },
    {
        "nombre": "Tópicos de Matemática Aplicada???",
        "profesor": "MSc. Fernando Rodriguez Flores",
        "descripcion": "Años y carreras a las que va dirigido: Estudiantes de 4to año Ciencia de la Computación\n \nObjetivo de la asignatura: \n\n    El objetivo de la asignatura es presentar elementos básicos de metaprogramación en Common Lisp, en particular el sistema de macros. \nSistema de conocimientos:\n\nIntroducción a Common Lisp.  Sistema de macros.  Programación orientada a objetos basada en funciones genéricas.  Diseño de lenguajes de dominio específico.  Herramientas para la creación de generadores de código en múltiples lenguajes.\nEvaluación:\n\nLos estudiantes deben diseñar e implementar un lenguaje de dominio específico utilizando Common Lisp y las herramientas creadas en la facultad para este propósito.\nBibliografía:\nGraham, Paul. On Lisp: Advanced Techniques for Common Lisp. Prentice Hall, 1993. ISBN 0130305529.\nGraham, Paul. ANSI Common Lisp. Prentice Hall, 1996. ISBN 0-13-370875-6.\nBarski, Conrad. Land of Lisp: Learn to Program in Lisp, One Game at a Time!. No Starch Press, 2010. ISBN 978-1-59327-281-4.\nKeene, Sonya E.. Object-Oriented Programming in Common Lisp: A Programmer's Guide to CLOS. Addison-Wesley, 1989. ISBN 0-201-17589-4.",
        "plazas": 4,
        "relacionadas": [
            "Programación"
        ]
    },
    {
        "nombre": "Introducción matemática a las Redes Neuronales Artificiales",
        "profesor": "MSc. Fernando Rodriguez Flores",
        "descripcion": "Duración: 32 horas\n \nAños y carreras a las que va dirigido: Estudiantes de Licenciatura en Matemática y carreras afines.  Requisitos mínimos: programación básica en Python y elementos de funciones reales de varias variables.\n \nObjetivo de la asignatura: \n\n   Presentar los fundamentos matemáticos básicos de las redes neuronales, así como la justificación matemática de su funcionamiento y los resultados que brindan.\nSistema de conocimientos:\n\n  Solución de problemas de optimización con Python.  Problema de mínimos cuadrados.  Las redes neuronales como caso particular de función paramétrica.  Entrenamiento de una red neuronal.  Algoritmo de máximo descenso.  Máximo descenso estocástico.  Teoremas de aproximación universal.  Algunas aplicaciones de redes neuronales.  Uso de bibliotecas de redes neuronales.\nEvaluación:\n\nResolver un problema práctico usando redes neuronales.\n\nBibliografía:\n\n - Aggarwal, Charu C. Neural Networks and Deep Learning: A Textbook. Springer, 2018.\n  \n - Deisenroth, Marc Peter, A. Aldo Faisal, and Cheng Soon Ong. Mathematics for Machine Learning. Cambridge University Press, 2020.",
        "plazas": 25,
        "relacionadas": [
            "Machine Learning",
            "IA",
            "Programación"
        ]
    },
    {
        "nombre": "Modelos matemáticos para el arte y la cultura",
        "profesor": "MSc. Fernando Rodriguez Flores",
        "descripcion": "Duración: 32 horas\n \nAños y carreras a las que va dirigido: Estudiantes de Licenciatura en Matemática\n \nObjetivo de la asignatura: \n\n   - Mostrar aplicaciones existentes de la matemática en temas relacionadas con el arte, la cultura y el sexo.\n   - Usar los conocimientos y habilidades adquiridos durante su formación para obtener nuevos resultados en estas áreas.\nSistema de conocimientos:\n\n   Modelos matemáticos para los malabares.  Geometría y metaheurísticas aplicadas al origami.  Elementos de la teoría de juegos aplicadas al proceso de cortejo y de selección de pareja.  Algoritmos de emparejamiento.  Ecuaciones diferenciales ordinarias para modelar relaciones interpersonales. Algoritmos de recomendación para sitios de citas y para el humor.  Procesos estocásticos y problema de la parada óptima.  Teoría de grupos aplicada al cubo Rubik y al baile.  Elementos básicos de la teoría de grafos aplicados a redes sociales.  Inferencia estadística para la distribución de las parejas en un contexto determinado.  Métodos y modelos de optimización en los malabares, la vida de pareja y el sexo.\n\nEvaluación:\n\nConstruir un modelo (o modificar uno existente) para describir, estudiar y analizar algún aspecto del arte y la cultura relacionado con los intereses de los estudiantes.\n\nBibliografía:\n-Clio Cresswell. Mathematics and Sex. Allen & Unwin, Crows Nest, Australia, 2003.\n-Hannah Fry.  The mathematics of love: Patterns, proofs and the search for the ultimate equation. Simon & Schuster, London. 2015.\n-Edward Frenkel. Love and Math: The heart of hidden reality. Basics Books.  Preseus Books Group.  New York. 2013.\n-John Gottam et al. The mathematics of marriage: Dynamic non linear models. The MIT Press. 2002\n-Burkard Polster.  The mathematics of juggling.  Springer.  2002.\n-Wei Li.  A new design method framework for open origami design problems. Tesis doctoral, Texas A&M University.  2014.\n-Joyner W.D.  The mathematics of Rubik's Cube.  Lecture notes.  1997.",
        "plazas": -1,
        "relacionadas": [
            "Modelos Matemáticos Aplicados",
            "Ecuaciones Diferenciales Ordinarias"
        ]
    },
    {
        "nombre": "EcuacionesDiferenciales++",
        "profesor": "Msc. Fernando Rodríguez Flores",
        "descripcion": "Duración:\n\n48 horas \n\nAños y carreras a las que va dirigido:\n\n4to año de Ciencia de la Computación\n\nObjetivo de la asignatura:\n\nBrindar a los estudiantes herramientas teóricas y computacionales para modelar situaciones y problemas del mundo real usando ecuaciones diferenciales, así como para solucionar los modelos resultantes e interpretar los resultados. \n\nSistema de conocimientos:\n\n  - Ecuaciones diferenciales ordinarias\n  - Ecuaciones en derivadas parciales\n  - Ecuaciones álgebro diferenciales\n  - Ecuaciones diferenciales ordinarias con retardo\n  - Ecuaciones diferenciales estocásticas\n  - Modelos basados en problemas de Cauchy\n  - Modelos basados en problemas de frontera\n  - Modelos basados en ecuaciones en derivadas parciales\n  - Redes Neuronales Diferenciales\n  - Métodos clásicos para la solución numérica de ecuaciones diferenciales\n  - Métodos para la solución de ecuaciones diferenciales basados en redes neuronales\n  - Tipos de modelos\n    - modelos de poblaciones (basados en EDOs y en EDPs)\n    - situaciones de la industria y la tecnología (EDOs y EDPs)\n    - modelos económicos (basados en ecuaciones diferenciales estocásticas)\n    - modelos para la enseñanza aprendizaje basados en EDOs\n    - Ecuaciones diferenciales ordinarias para modelar Redes Neuronales\n\nEvaluación:\n\nAplicar los contenidos del curso a un problema específico, que esté relacionado con alguno de los grupos de investigación de la facultad.\n\n\nBibliografía:\n\n  - Robert Smith?.  Mathematical Modelling of Zombies.  2014.  University of Ottawa Press.  \n  - Bernhelm Booß-Bavnbek, Jens Høyrup.  Mathematics and war.  2003.  Birkhäuser\n  - John Cannarella and Joshua A. Spechler.  Epidemiological modeling of online social network dynamics.  2014.\n  - Alfio Borzi.  Modelling With Ordinary Differential Equations. A comprehensive approach. 2020.  CRC Press.\n  - T. P. Dreyer.  Modelling With Ordinary Differential Equations. 1993.  CRC Press.",
        "plazas": 7,
        "relacionadas": []
    }
]